{% extends "base.html" %}


{% block scripts %}
{{super()}}

<script type="text/javascript">
 recentlyPublishedWorksSparql = `
# Recent works published in venue
SELECT
  (MIN(?publication_date_) AS ?publication_date)
  ?work ?workLabel
  (GROUP_CONCAT(?author_label; separator=" // ") AS ?authors)
WHERE {
  ?work wdt:P1433 wd:{{ q }} .
  OPTIONAL {
    ?work wdt:P577 ?publication_datetime . 
    BIND(xsd:date(?publication_datetime) AS ?publication_date_)
  }
  OPTIONAL {
    ?work wdt:P50/rdfs:label ?author_label .
    FILTER (LANG(?author_label) = 'en')
  }
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,da,de,es,fr,jp,nl,no,ru,sv,zh" . } 
}
GROUP BY ?work ?workLabel
ORDER BY DESC(?publication_date)
LIMIT 1000
`

 topicsSparql = `
#defaultView:Table
# Count of topics in published work in specified venue
SELECT ?count ?topic ?topicLabel ?example_work ?example_workLabel
WITH {
  SELECT 
    (COUNT(?work) as ?count)
    ?topic
    (SAMPLE(?work) AS ?example_work)
  WHERE {
    ?work wdt:P1433 wd:{{ q }} .
    ?work wdt:P921 ?topic .
  }
  GROUP BY ?topic
} AS %result
WHERE {
  INCLUDE %result
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,da,de,es,fr,jp,nl,no,ru,sv,zh" . } 
}
ORDER BY DESC(?count)
`

 prolificAuthorsSparql = `
# Prolific authors for a specific journal
SELECT ?count ?author ?authorLabel ?orcid ?example_work ?example_workLabel
WITH {
  # Count the number of works author by the author publishing in the journal
  SELECT
    ?author
    (COUNT(?work) AS ?count)
    (SAMPLE(?work) AS ?example_work)
  WHERE {
    ?work wdt:P50 ?author ;
          wdt:P1433 wd:{{ q }} .
  }
  GROUP BY ?author
} AS %result
WHERE {
  INCLUDE %result 
          
  # Include optional ORCID iD
  OPTIONAL { ?author wdt:P496 ?orcid . }
  
  # Label the results
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,da,de,es,fr,jp,no,ru,sv,zh" . } 
}
ORDER BY DESC(?count)
LIMIT 50
 `
  coAuthorsSparql = `
#defaultView:Graph
SELECT ?author1 ?author1Label ?rgb ?author2 ?author2Label
WITH {
  # Find works published in the given venue
  SELECT ?work WHERE {
    ?work wdt:P1433 wd:{{ q }} .
  }
} AS %works
WITH {
  # Limit the number of authors
  SELECT (COUNT(?work) AS ?count1) ?author1 WHERE {
    INCLUDE %works
    ?work wdt:P50 ?author1 .
  }
  GROUP BY ?author1
  ORDER BY DESC(?count1)
  LIMIT 15
} AS %authors1
WITH {
  # Limit the number of coauthors
  SELECT DISTINCT ?author2 ?author1  (COUNT(?work) AS ?count2)  WHERE {
    INCLUDE %works
    INCLUDE %authors1
    ?work wdt:P50 ?author1 , ?author2 .
    FILTER (?author1 != ?author2) 
  }
  GROUP BY ?author2 ?author1 
  ORDER BY DESC(?count2)
  LIMIT 150
} AS %authors2
WHERE {
#  INCLUDE %authors1
  INCLUDE %authors2
  OPTIONAL { ?author1 wdt:P21 ?gender1 . }
  BIND( IF(?gender1 = wd:Q6581097, "3182BD", "E6550D") AS ?rgb)
  SERVICE wikibase:label {
    bd:serviceParam wikibase:language "en,fr,de,ru,es,zh,jp".
  }
}

  `

  citedVenuesSparql = `
# Cited venues from specific journal
SELECT
  ?count
  ?short_name
  ?cited_journal ?cited_journalLabel
WITH {
  SELECT
    (COUNT(?cited_work) AS ?count)
    ?cited_journal
    (SAMPLE(?short_name_) AS ?short_name)
  WHERE {
    ?work wdt:P1433 wd:{{ q }} .
    ?work wdt:P2860 ?cited_work .
    ?cited_work wdt:P1433 ?cited_journal . 
    OPTIONAL {
      ?work wdt:P577 ?publication_datetime .
      BIND(xsd:date(?publication_datetime) AS ?publication_date)
    }
    OPTIONAL { ?cited_journal wdt:P1813 ?short_name_ . }
  }
  GROUP BY ?cited_journal
} AS %result
WHERE {
  INCLUDE %result
  SERVICE wikibase:label {
    bd:serviceParam wikibase:language "en,da,de,es,fr,jp,nl,no,ru,sv,zh" . } 
}
ORDER BY DESC(?count)
LIMIT 200
`

 citingVenuesSparql = `
#defaultView:Table
# Venues citing articles from this specific journal
SELECT
  ?count
  ?short_name
  ?citing_journal ?citing_journalLabel 
WITH {
  SELECT
    (COUNT(?citing_work) as ?count)
    ?citing_journal
    (SAMPLE(?short_name_) AS ?short_name)
  WHERE {
    ?work wdt:P1433 wd:{{ q }} .
    ?citing_work wdt:P2860 ?work .
    ?citing_work wdt:P1433 ?citing_journal .
    OPTIONAL { ?citing_journal wdt:P1813 ?short_name_ . }
  }
  GROUP BY ?citing_journal
  ORDER BY DESC(?count)
  LIMIT 1000
} AS %result
WHERE {
  INCLUDE %result
  SERVICE wikibase:label {
    bd:serviceParam wikibase:language "en,da,de,es,fr,jp,nl,no,ru,sv,zh" . } 
}
ORDER BY DESC(?count)
  `

 mostCitedWorksSparql = `
#defaultView:Table
# Most cited works published in venue
SELECT
  ?count
  ?work ?workLabel
  ?example_citing_work ?example_citing_workLabel
WITH {
  # Count citations
  SELECT
    (COUNT(?citing_work) AS ?count)
    ?work
    (SAMPLE(?citing_work) AS ?example_citing_work)
  WHERE {
    ?work wdt:P1433 wd:{{ q }} .
    ?citing_work wdt:P2860 ?work.
  }
  GROUP BY ?work
  ORDER BY DESC(?count)
  LIMIT 1000  
} AS %result
WHERE {
  # Label results
  INCLUDE %result
  SERVICE wikibase:label {
    bd:serviceParam wikibase:language "en,da,de,es,fr,jp,nl,no,ru,sv,zh" . } 
}
ORDER BY DESC(?count)
  `

 mostCitedAuthorsSparql = `
# Most cited authors published in venue
SELECT
  ?count
  ?author ?authorLabel
  ?orcid
  ?example_cited_work ?example_cited_workLabel
  ?example_citing_work ?example_citing_workLabel
WITH {
  # Count the number of citations
  SELECT
    ?author
    (COUNT(?cited_work) AS ?count)
    (SAMPLE(?cited_work) AS ?example_cited_work)
    (SAMPLE(?citing_work) AS ?example_citing_work)
  WHERE {
    ?cited_work wdt:P1433 wd:{{ q }} .
    ?citing_work wdt:P2860 ?cited_work .
    ?cited_work wdt:P50 ?author .
  }
  GROUP BY ?author
} AS %result
WHERE {
  INCLUDE %result 
          
  # Include optional ORCID iD
  OPTIONAL { ?author wdt:P496 ?orcid . }
  
  # Label the results
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,da,de,es,fr,jp,no,ru,sv,zh" . } 
}
ORDER BY DESC(?count)
LIMIT 100
  `


 genderDistributionSparql = `
SELECT ?count ?gender ?genderLabel 
WITH {
  SELECT (COUNT(DISTINCT ?author) AS ?count) ?gender WHERE {
    ?work wdt:P1433 wd:{{ q }} .
    ?work wdt:P50 ?author .
    ?author wdt:P21 ?gender .
  } 
  GROUP BY ?gender
} AS %result
WHERE {
  INCLUDE %result
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,da,de,ep,fr,jp,nl,no,ru,sv,zh" . } 
} 
 ORDER BY DESC(?count)
 `

 authorshipsGenderDistributionSparql = `
SELECT ?count ?gender ?genderLabel 
WITH {
  SELECT (COUNT(?author) AS ?count) ?gender WHERE {
    ?work wdt:P1433 wd:{{ q }} .
    ?work wdt:P50 ?author .
    ?author wdt:P21 ?gender .
  } 
  GROUP BY ?gender
} AS %result
WHERE {
  INCLUDE %result
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,da,de,ep,fr,jp,nl,no,ru,sv,zh" . } 
} 
 ORDER BY DESC(?count)
 `

 authorAwardsSparql = `
SELECT DISTINCT
  ?year 
  ?author ?authorLabel
  ?award ?awardLabel ?awardDescription
WHERE {
  [] wdt:P1433 wd:{{ q }} ;
     wdt:P50 ?author .
  ?author p:P166 ?award_statement .
  ?award_statement ps:P166 ?award .
  OPTIONAL {
    { ?award_statement pq:P585 ?time }
    UNION
    { ?award_statement pq:P580 ?time }
    BIND(YEAR(?time) AS ?year)
  }
  SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en,da,de,ep,fr,jp,nl,no,ru,sv,zh". }  
}
ORDER BY DESC(?year)
LIMIT 500
 `

 $(document).ready(function() {
     sparqlToDataTable(recentlyPublishedWorksSparql, "#recently-published-works");
     sparqlToDataTable(topicsSparql, "#topics");
     sparqlToDataTable(prolificAuthorsSparql, "#prolific-authors");
     sparqlToDataTable(coAuthorsSparql, "#co-authors");
     sparqlToDataTable(citedVenuesSparql, "#cited-venues");
     sparqlToDataTable(citingVenuesSparql, "#citing-venues");
     sparqlToDataTable(mostCitedWorksSparql, "#most-cited-works");
     sparqlToDataTable(mostCitedAuthorsSparql, "#most-cited-authors");
     sparqlToDataTable(genderDistributionSparql, "#gender-distribution");
     sparqlToDataTable(authorshipsGenderDistributionSparql,
		       "#authorships-gender-distribution");
     sparqlToDataTable(authorAwardsSparql, "#author-awards");
 });
</script>


{% endblock %}



{% block page_content %}
<h1 id="h1">Venue</h1>

<div id="intro"></div>

<div id="wembedder"></div>



<h2>Recently published works <a href="{{ url_for('app.show_venue_empty') }}{{ q }}/latest-works/rss"><img height="24" width="48" src="{{ url_for('static', filename='images/rss-40674_320.png') }}" alt="RSS icon" /></a></h2>

<table class="table table-hover" id="recently-published-works"></table>


<h2 id="Topics">Topics</h2>

<table class="table table-hover" id="topics"></table>



<h2 id="Authors">Authors</h3>

<h3 id="Author images">Author images</h2>

<div class="embed-responsive embed-responsive-4by3">
  <iframe class="embed-responsive-item" src="https://query.wikidata.org/embed.html#%23defaultView%3AImageGrid%0ASELECT%20%28SAMPLE%28%3Fimage_%29%20AS%20%3Fimage%29%20%3Fauthor%20%3FauthorLabel%20%3Fcount%0AWITH%20%7B%0A%20%20SELECT%20%3Fauthor%20%28COUNT%28%3Fwork%29%20AS%20%3Fcount%29%20WHERE%20%7B%0A%20%20%20%20%3Fwork%20wdt%3AP1433%20wd%3A{{ q }}%3B%0A%20%20%20%20%20%20%20%20%20%20wdt%3AP50%20%3Fauthor%20.%0A%20%20%7D%0A%20%20GROUP%20BY%20%3Fauthor%0A%7D%20AS%20%25authors%0AWHERE%20%7B%0A%20%20INCLUDE%20%25authors%0A%20%20%3Fauthor%20wdt%3AP18%20%3Fimage_%20.%0A%20%20SERVICE%20wikibase%3Alabel%20%7B%20bd%3AserviceParam%20wikibase%3Alanguage%20%22en%2Cda%2Cde%2Ces%2Cfr%2Cjp%2Cnl.no%2Cru%2Csv%2Czh%22%20.%20%7D%20%0A%7D%0AGROUP%20BY%20%3Fauthor%20%3FauthorLabel%20%3Fcount%0AORDER%20BY%20DESC%28%3Fcount%29%0ALIMIT%2050%20%20"></iframe>
</div>


<h3 id="Prolific authors">Prolific authors</h3>

<table class="table table-hover" id="prolific-authors"></table>

Missing authors here?
Then go to the
<a href="{{ url_for('app.show_venue_empty') }}{{ q }}/missing">missing</a>
page to resolve the author names.


<h3 id="Co-author graph">Co-author graph</h3>

<div class="embed-responsive embed-responsive-4by3">
  <iframe class="embed-responsive-item" src="https://query.wikidata.org/embed.html#%23defaultView%3AGraph%0ASELECT%20%3Fauthor1%20%3Fauthor1Label%20%3Frgb%20%3Fauthor2%20%3Fauthor2Label%0AWITH%20%7B%0A%20%20%23%20Find%20works%20published%20in%20the%20given%20venue%0A%20%20SELECT%20%3Fwork%20WHERE%20%7B%0A%20%20%20%20%3Fwork%20wdt%3AP1433%20wd%3A{{ q }}%20.%0A%20%20%7D%0A%7D%20AS%20%25works%0AWITH%20%7B%0A%20%20%23%20Limit%20the%20number%20of%20authors%0A%20%20SELECT%20%28COUNT%28%3Fwork%29%20AS%20%3Fcount1%29%20%3Fauthor1%20WHERE%20%7B%0A%20%20%20%20INCLUDE%20%25works%0A%20%20%20%20%3Fwork%20wdt%3AP50%20%3Fauthor1%20.%0A%20%20%7D%0A%20%20GROUP%20BY%20%3Fauthor1%0A%20%20ORDER%20BY%20DESC%28%3Fcount1%29%0A%20%20LIMIT%2015%0A%7D%20AS%20%25authors1%0AWITH%20%7B%0A%20%20%23%20Limit%20the%20number%20of%20coauthors%0A%20%20SELECT%20DISTINCT%20%3Fauthor2%20%3Fauthor1%20%20%28COUNT%28%3Fwork%29%20AS%20%3Fcount2%29%20%20WHERE%20%7B%0A%20%20%20%20INCLUDE%20%25works%0A%20%20%20%20INCLUDE%20%25authors1%0A%20%20%20%20%3Fwork%20wdt%3AP50%20%3Fauthor1%20%2C%20%3Fauthor2%20.%0A%20%20%20%20FILTER%20%28%3Fauthor1%20%21%3D%20%3Fauthor2%29%20%0A%20%20%7D%0A%20%20GROUP%20BY%20%3Fauthor2%20%3Fauthor1%20%0A%20%20ORDER%20BY%20DESC%28%3Fcount2%29%0A%20%20LIMIT%20150%0A%7D%20AS%20%25authors2%0AWHERE%20%7B%0A%23%20%20INCLUDE%20%25authors1%0A%20%20INCLUDE%20%25authors2%0A%20%20OPTIONAL%20%7B%20%3Fauthor1%20wdt%3AP21%20%3Fgender1%20.%20%7D%0A%20%20BIND%28%20IF%28%3Fgender1%20%3D%20wd%3AQ6581097%2C%20%223182BD%22%2C%20%22E6550D%22%29%20AS%20%3Frgb%29%0A%20%20SERVICE%20wikibase%3Alabel%20%7B%0A%20%20%20%20bd%3AserviceParam%20wikibase%3Alanguage%20%22en%2Cfr%2Cde%2Cru%2Ces%2Czh%2Cjp%22.%0A%20%20%7D%0A%7D%0A"></iframe>
</div>


<h2 id="Citations">Citations</h2>

<h3 id="Most cited articles"
    title="Most cited articles published in the venue, where the citations may come from any venue">Most cited articles</h3>

<table class="table table-hover" id="most-cited-works"></table>

<h3 id="Most cited authors"
    title="Most cited authors based on articles published in the venue and where citations may come from any venue">Most cited authors</h3>

<table class="table table-hover" id="most-cited-authors"></table>

<h3 id="Citation distribution">Citation distribution</h2>

<div class="embed-responsive embed-responsive-16by9">
    <iframe class="embed-responsive-item" src="https://query.wikidata.org/embed.html#%23defaultView%3ALineChart%0Aselect%20%3Fnumber_of_citations%20%28count%28%3Fwork%29%20as%20%3Fcount%29%20where%20%7B%0A%20%20%7B%0A%20%20%20%20SELECT%20%3Fwork%20%28COUNT%28%3Fciting_work%29%20AS%20%3Fnumber_of_citations%29%0A%20%20%20%20WHERE%20%7B%0A%20%20%20%20%20%20%3Fwork%20wdt%3AP1433%20wd%3A{{ q }}.%20%20%20%0A%20%20%20%20%20%20optional%20%7B%20%3Fciting_work%20wdt%3AP2860%20%3Fwork%20.%20%7D%0A%20%20%20%20%7D%0A%20%20%20%20GROUP%20BY%20%3Fwork%20%0A%20%20%7D%0A%7D%20%0Agroup%20by%20%3Fnumber_of_citations%0Aorder%20by%20desc%28%3Fnumber_of_citations%29%0A"></iframe>
</div>



<h3 id="Cited venues">Cited venues</h3>

<table class="table table-hover" id="cited-venues"></table>


<h3 id="Venues cited from">Venues cited from</h3>

<table class="table table-hover" id="citing-venues"></table>


<h2>Gender distribution</h2>


<h3>Authors</h3>

Distinct authors.

<table class="table table-hover" id="gender-distribution"></table>

<h3>Authorships</h3>

<table class="table table-hover" id="authorships-gender-distribution"></table>


<h2 id="AuthorAwards">Author Awards</h2>

<table class="table table-hover" id="author-awards"></table>

{% endblock %}
    
